import { FC } from "react";
import { DeleteAction } from "../../../features/deleteAction";
import classes from './freelancerDelete.module.scss'
import { freelancerService } from "../../../entities/freelancer";

interface IProps{
    freelancerId: number;
}

export const FreelancerDelete: FC<IProps> = ({freelancerId}) => {

    return (
        <DeleteAction 
            questionText='Вы уверены что хотите удалить помощника?'
            successText='Успешное удаление помощника'
            errorText='Ошибка при удалении помощника'
            onDelete={() => freelancerService.deleteFreelancer(freelancerId)}
        >
            <svg className={classes.delete} width="34" height="41" viewBox="0 0 34 41" fill="none" xmlns="http://www.w3.org/2000/svg">
                <path fillRule="evenodd" clipRule="evenodd" d="M8.77419 1.74361C8.77419 0.780648 9.51077 0 10.4194 0H23.5806C24.4892 0 25.2258 0.780648 25.2258 1.74361C25.2258 2.70657 24.4892 3.48721 23.5806 3.48721H10.4194C9.51077 3.48721 8.77419 2.70657 8.77419 1.74361ZM0 9.18299C0 8.22004 0.736572 7.43939 1.64516 7.43939H32.3548C33.2634 7.43939 34 8.22004 34 9.18299C34 10.146 33.2634 10.9266 32.3548 10.9266H31.8065V34.3625C31.8065 37.8802 29.0825 40.6842 25.7742 40.6842H8.22581C4.91747 40.6842 2.19355 37.8802 2.19355 34.3625V10.9266H1.64516C0.736572 10.9266 0 10.146 0 9.18299ZM5.48387 10.9266V34.3625C5.48387 35.9034 6.6864 37.1969 8.22581 37.1969H25.7742C27.3136 37.1969 28.5161 35.9034 28.5161 34.3625V10.9266H5.48387ZM12.6129 16.5956C13.5215 16.5956 14.2581 17.3761 14.2581 18.3393V29.7843C14.2581 30.7475 13.5215 31.5279 12.6129 31.5279C11.7043 31.5279 10.9677 30.7475 10.9677 29.7843V18.3393C10.9677 17.3761 11.7043 16.5956 12.6129 16.5956ZM21.3871 16.5956C22.2957 16.5956 23.0323 17.3761 23.0323 18.3393V29.7843C23.0323 30.7475 22.2957 31.5279 21.3871 31.5279C20.4785 31.5279 19.7419 30.7475 19.7419 29.7843V18.3393C19.7419 17.3761 20.4785 16.5956 21.3871 16.5956Z" />
            </svg>
        </DeleteAction>
    )
}